//------------------------------------------------------------
// 2023. 3. 23 목56								(4주 1일)
// 3. 30 목(5주 1) - 학과 MT ( e-class에 업로드, 출석은 대체)
// 4. 3 예비군 훈련 - 수업 강의녹화 영상을 e-class에 제공
//------------------------------------------------------------
// 정렬(sort) - callable type, 호출가능 타입
//------------------------------------------------------------
#include <iostream>
#include <functional>
#include "save.h"

//-------
int main()
//-------
{
	int (*fp)() = main;

	//int반환에 매개변수 보이드
	std::function<int()> f = main;
	f = fp;

	save("소스.cpp");
}

